convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/CconvertLead.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:majorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MAJORNUMBER)</urn:majorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:minorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MINORNUMBER)</urn:minorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:namespace>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_NAMESPACE)</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:DebuggingHeader>
         <!--type: {urn:partner.soap.sforce.com}DebugLevel - enumeration: [None,DebugOnly,Db]-->
         <urn:debugLevel>$(HEADER_DEBUGGINGHEADER_DEBUGLEVEL)</urn:debugLevel>
      </urn:DebuggingHeader>
      <urn:StreamingEnabledHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:streamingEnabled>$(HEADER_STREAMINGENABLEDHEADER_STREAMINGENABLED)</urn:streamingEnabled>
      </urn:StreamingEnabledHeader>
      <urn:DisableFeedTrackingHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:disableFeedTracking>$(HEADER_DISABLEFEEDTRACKINGHEADER_DISABLEFEEDTRACKING)</urn:disableFeedTracking>
      </urn:DisableFeedTrackingHeader>
      <urn:AllowFieldTruncationHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:allowFieldTruncation>$(HEADER_ALLOWFIELDTRUNCATIONHEADER_ALLOWFIELDTRUNCATION)</urn:allowFieldTruncation>
      </urn:AllowFieldTruncationHeader>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:convertLead>
         <!--Zero or more repetitions:-->
         <urn:leadConverts>
            <!--type: {urn:partner.soap.sforce.com}ID-->
            <urn:accountId>$(BODY_CONVERTLEAD_LEADCONVERTS_ACCOUNTID)</urn:accountId>
            <!--type: {urn:partner.soap.sforce.com}ID-->
            <urn:contactId>$(BODY_CONVERTLEAD_LEADCONVERTS_CONTACTID)</urn:contactId>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:convertedStatus>$(BODY_CONVERTLEAD_LEADCONVERTS_CONVERTEDSTATUS)</urn:convertedStatus>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:doNotCreateOpportunity>$(BODY_CONVERTLEAD_LEADCONVERTS_DONOTCREATEOPPORTUNITY)</urn:doNotCreateOpportunity>
            <!--type: {urn:partner.soap.sforce.com}ID-->
            <urn:leadId>$(BODY_CONVERTLEAD_LEADCONVERTS_LEADID)</urn:leadId>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:opportunityName>$(BODY_CONVERTLEAD_LEADCONVERTS_OPPORTUNITYNAME)</urn:opportunityName>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:overwriteLeadSource>$(BODY_CONVERTLEAD_LEADCONVERTS_OVERWRITELEADSOURCE)</urn:overwriteLeadSource>
            <!--type: {urn:partner.soap.sforce.com}ID-->
            <urn:ownerId>$(BODY_CONVERTLEAD_LEADCONVERTS_OWNERID)</urn:ownerId>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:sendNotificationEmail>$(BODY_CONVERTLEAD_LEADCONVERTS_SENDNOTIFICATIONEMAIL)</urn:sendNotificationEmail>
         </urn:leadConverts>
      </urn:convertLead>
   </soapenv:Body>
</soapenv:Envelope>